Tekla Open API Reference for Tekla Structures 2025
MaterialCatalog Properties
The MaterialCatalog type exposes the following members.
Properties
Name | Description
ButtonText
 Gets and sets the text of the button control.
SelectedMaterial
 Gets the selected material in the control.
Top
See Also
Reference
MaterialCatalog Class
Tekla.Structures.Dialog.UIControls Namespace